GetCategoryHidden Method
 Checks if elements of the given category are set to be invisible (hidden) in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool GetCategoryHidden(
	ElementId categoryId
)
Visual Basic
Public Function GetCategoryHidden ( _
	categoryId As ElementId _
) As Boolean
Visual C++
public:
bool GetCategoryHidden(
	ElementId^ categoryId
)
Parameters
categoryId
Type: Autodesk.Revit.DBElementId
 The ID of the category.
Return Value
 True if the category is invisible (hidden), false otherwise.
Remarks
 This checks only if the category is set visible or invisible individually. Other Revit mechanisms may also affect the visibility of elements of this category, including:
 The category classes settings for model categories, annotation categories, import categories or analytical model categories.
 View filters.
 Elements hidden individually in the view.
 Thus the return value may not reflect the actual visibility of elements of this category in the view.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  categoryId does not correspond to a Category.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →